In [1]:
import pandas as pd

The useful files are:
<p>
"data/course_classroom.csv","data/course_match.csv","data/course_match_student_match.csv",
"data/course_questionresponse.csv","data/course_questionresponse_new_response.csv",
"data/course_questionresponse_new_subresponse.csv","data/course_subquestionresponse.csv",
"data/user_app_address.csv","data/user_app_customuser.csv","data/user_messages_message.csv".
</p>

In [6]:
files=["data/course_match.csv","data/course_questionresponse.csv","data/course_questionresponse_new_response.csv","data/course_questionresponse_new_subresponse.csv","data/course_subquestionresponse.csv","data/user_app_address.csv","data/user_app_customuser.csv","data/user_messages_message.csv"]

In [7]:
def printFile(filePath):
    with open(filePath,'r') as f:
        #data = pd.read_csv(f,delim_whitespace=True,header=None,error_bad_lines=False)
        data = pd.read_csv(f)
        print "=================",filePath,"================="
        #print "summary:\n",data.describe(),"\n\nhead:"
        print data.head(10),'\n'
        #return data

In [8]:
for fi in files:
    printFile(fi)

================= data/course_match.csv =================
      id  student_id  classroom_id  \
0  97395      123884        8253.0
1  99041      125418        7989.0
2  12327       17867        1998.0
3  12632       18857        1911.0
4  45091       60318        4072.0
5     50         154          69.0
6     44         148          69.0
7     32         134          69.0
8     34         138          69.0
9  12180       18321        1965.0

                                               intro new_match  age  \
0                Australia beacause they have coalas         f   13
1       Paris, France because it's the city of love.         f   13
2  We are a free country.\nWe drink water.\nWe bo...         t   13
3                                                NaN         t   15
4                                Watch a hockey game         t   10
5                                                NaN         f   12
6                                                NaN         f   12
7                                                NaN         f   12
8                                                NaN         f   12
9              we eat the same food as others places         t   11

  course_start_date target_start_date  course_id         skill state  \
0        2017-01-09        2017-01-09         15  Intermediate   NaN
1        2017-01-09        2017-01-09         14  Intermediate    FL
2        2015-05-25        2015-08-31          1      Beginner    AL
3               NaN        2015-08-31          1      Beginner    TX
4        2016-02-01        2016-01-18         11      Beginner    OR
5        2015-01-12        2015-01-12          1      Beginner   IL
6        2015-01-12        2015-01-12          1      Beginner   IL
7        2015-01-12        2015-01-12          1      Beginner   IL
8        2015-01-12        2015-01-12          1      Beginner   IL
9        2015-04-06        2015-08-26          1      Beginner    IA

         country                       activity  points pledge
0        Denmark  2017-01-26 09:03:08.858457+00     300      t
1  United States  2017-01-25 19:19:34.060776+00     300      t
2  United States  2015-08-30 19:15:09.928069+00     150      f
3  United States  2015-08-30 19:14:26.770596+00       0      f
4  United States   2016-01-29 20:15:01.09436+00     100      f
5  United States  2015-07-13 03:56:18.042467+00      25      f
6  United States  2015-07-13 03:56:18.042467+00      25      f
7  United States  2015-07-13 03:56:18.042467+00      25      f
8  United States  2015-07-13 03:56:18.042467+00      25      f
9  United States  2015-08-30 19:15:03.761284+00     100      f

================= data/course_questionresponse.csv =================
       id                        created                       modified  \
0       2  2015-01-12 18:31:50.344312+00  2015-01-12 18:31:54.440605+00
1       5  2015-01-12 18:32:37.276155+00  2015-01-12 18:32:37.282585+00
2       6  2015-01-12 18:33:19.903515+00  2015-01-12 18:33:19.934264+00
3  172014   2015-11-17 17:12:30.96388+00  2015-11-17 17:12:30.964101+00
4       8  2015-01-12 18:33:47.394602+00  2015-01-12 18:33:47.401315+00
5  178385   2015-11-20 19:23:19.98555+00  2015-11-20 19:23:19.985781+00
6      12  2015-01-12 18:35:19.214193+00  2015-01-12 18:35:19.220644+00
7  188776  2015-11-30 21:12:11.243468+00  2015-11-30 21:12:11.243811+00
8  189468  2015-12-01 03:22:47.879853+00  2015-12-01 03:22:47.880071+00
9      32  2015-01-13 01:34:13.846271+00  2015-01-13 01:34:13.852941+00

   match_id  question_id                                               text  \
0      2711         93.0                  global warning is melting the ice
1      2728         93.0       cuse theres camicle wast going in to the air
2      2711         92.0  i would save them by giving them proper needs ...
3     21614        607.0  There would be a picture of me playing shortst...
4      2728         92.0  stop and pick some up so they canlive longer a...
5     29877        577.0                        Because we are all the same
6      2728         76.0  is it cold in canda cuse it is here what is th...
7     26923        394.0                                      art, music...
8     27045        399.0                                        Pop culture
9      3111         30.0  Saving sea otters can affect the environment p...

   unit_id
0      1.0
1      1.0
2      1.0
3      6.0
4      1.0
5     52.0
6      1.0
7     43.0
8     44.0
9      1.0

================= data/course_questionresponse_new_response.csv =================
       id  questionresponse_id  match_id
0       1               380280     67460
1  399166               498955     90419
2   96433               406595     64826
3  115378               411807     76649
4  115379               411807     72798
5   96435               406595     64836
6       7               380281     67661
7       8               380282     67454
8       9               380282     66796
9  115380               411807     77646

================= data/course_questionresponse_new_subresponse.csv =================
       id  questionresponse_id  match_id
0   25419               391297     66962
1       2               379775     70537
2   25420               391297     67053
3   71916               435442     82687
4   25422               391297     67388
5       6               379413     70537
6    7723               385427     73015
7  132264               487702     85865
8   25747               396214     74268
9      10               379549     70621

================= data/course_subquestionresponse.csv =================
   id                        created                       modified  match_id  \
0   1  2015-08-18 14:39:04.842977+00  2015-08-18 14:39:04.845993+00      9978
1   2  2015-08-18 14:41:57.089341+00  2015-08-18 14:41:57.092381+00      9978
2   8  2015-08-20 17:17:55.361397+00  2015-08-20 17:17:55.364388+00     10136
3   9  2015-09-10 21:58:09.592454+00  2015-09-10 21:58:09.595085+00     14074
4  13  2015-09-25 18:17:47.240061+00  2015-09-25 18:17:47.242734+00     16263
5  14  2015-09-25 18:21:29.537575+00  2015-09-25 18:21:29.540349+00     16263
6  15  2015-09-25 18:22:37.231367+00  2015-09-25 18:22:37.233998+00     16263
7  16   2015-09-28 20:16:39.90144+00  2015-09-28 20:16:39.901826+00     14598
8  17  2015-09-28 20:17:06.777288+00  2015-09-28 20:17:06.777527+00     14598
9  18  2015-09-28 20:18:07.384153+00  2015-09-28 20:18:07.384487+00     14598

   response_id                                               text
0        55940  Russia has the highest obesity rate in the wor...
1        55941  Youre right there are some good Russian restau...
2        56281  I agree. When the British colonized Kenya they...
3        59145  I agree, many people care about wildlife and a...
4        72430  I honestly believe that people don't/won't pro...
5        72435  I agree with you because if you research the m...
6        72445                                 Refineries and Oil
7        76593  We get around by car, foot, bike, motercycle, ...
8        76593            I love to play ulitment frisbee and run
9        76597  I think the hardest part is finding a stable g...

/Users/Wenbo/anaconda/lib/python2.7/site-packages/IPython/core/interactiveshell.py:2821: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  if self.run_code(code, result):

================= data/user_app_address.csv =================
   id street_line1 street_line2 zipcode       city     state          country  \
0   2          NaN          NaN     NaN         SF       CA    United States
1   3          NaN          NaN     NaN    Watford  England   United Kingdom
2   4          NaN          NaN     NaN     Austin       TX    United States
3   5          NaN          NaN     NaN     Austin       TX    United States
4   6          NaN          NaN     NaN         CF       NaN       Argentina
5   7          NaN          NaN     NaN        NaN       NaN             None
6   8          NaN          NaN     NaN        NaN       NaN             None
7   9          NaN          NaN     NaN        NaN       NaN             None
8  39          NaN          NaN     NaN  Wadsworth        IL    United States
9  11          NaN          NaN     NaN        NaN       NaN             None

             formatted_address        lat         lng
0      San Francisco, CA, USA   37.774929 -122.419415
1  Watford, Hertfordshire, UK   51.656489   -0.390320
2             Austin, TX, USA   30.267153  -97.743061
3             Austin, TX, USA   30.267153  -97.743061
4     Buenos Aires, Argentina  -34.603684  -58.381559
5                          NaN        NaN         NaN
6                          NaN        NaN         NaN
7                          NaN        NaN         NaN
8           Wadsworth, IL, USA  42.428632  -87.923965
9                          NaN        NaN         NaN

================= data/user_app_customuser.csv =================
                                            password  \
0  pbkdf2_sha256$12000$Wf2vl1BrW9WX$ZfVHGrNWLRq6D...
1  pbkdf2_sha256$12000$cPQMz5fraEOn$1OsUaJ0VVtoaR...
2  pbkdf2_sha256$12000$cEHyyRBX7on0$qWWTL9NIJSRhT...
3  pbkdf2_sha256$12000$AndikQI7dHS2$LPNBYi3YTk/5c...
4  pbkdf2_sha256$12000$rwSFwTZ6FUnI$rl//4QjOHtJF4...
5  pbkdf2_sha256$12000$xmsQel2yqXla$ASQa/PoecRyXe...
6  pbkdf2_sha256$12000$17PGTdCX3QLc$iMmX6OMe1SN8+...
7  pbkdf2_sha256$12000$40GCeGqPbWdU$7sx9KGhS1hhJA...
8  pbkdf2_sha256$12000$qqe4fk9guBUk$gMGK4enKdJduT...
9  pbkdf2_sha256$12000$TzR22TYQ4bO2$5lkTTkBRIOnSc...

                      last_login is_superuser     id     username  \
0  2015-01-26 23:17:29.798899+00            f   4950        Sonya
1  2015-01-02 01:35:32.875542+00            f      9      Brankoe
2  2015-01-06 14:36:01.970408+00            f    437  john.porter
3  2015-01-27 15:36:51.889319+00            f   5014     Hannah77
4  2015-04-14 17:21:45.903994+00            f  12093   Mercedes77
5  2014-12-31 03:52:34.318484+00            f      2         Zhuf
6  2014-12-31 15:14:49.786013+00            f      3    oxheywood
7  2015-01-27 19:56:40.499636+00            f   5066     Byrock07
8  2015-01-28 03:13:35.913577+00            f   5079       rongar
9  2015-01-03 11:40:08.603636+00            f     31     ruby2007

                    email first_name last_name gender  tier  \
0     sonyafb@hotmail.com      Sonya  figueroa    NaN     2
1                     NaN     Branko         E      M     1
2                     NaN       John         P      M     1
3                     NaN     Hannah         M    NaN     1
4                     NaN   Mercedes       NaN      F     1
5          zhuf@sfusd.edu  Fengsheng       Zhu    NaN     2
6  mikki.caplan@gmail.com      Mikki    Caplan    NaN     2
7                     NaN      Byron         B      M     1
8                     NaN     Ronald         G      M     1
9                     NaN      Subin         L      F     1

               ...                \
0              ...
1              ...
2              ...
3              ...
4              ...
5              ...
6              ...
7              ...
8              ...
9              ...

                                                 bio primary_address_id  \
0                                                NaN             4949.0
1                                                NaN                9.0
2                                                NaN              437.0
3  I love to play volleyball, study marine life, ...             5013.0
4                                                NaN            11531.0
5                                                NaN                2.0
6                                                NaN                3.0
7                                                NaN             5065.0
8                                                NaN             5078.0
9                                                NaN               31.0

   stripe_id is_staff is_active                    date_joined  \
0        NaN        f         t  2015-01-26 23:17:29.798899+00
1        NaN        f         t  2015-01-02 01:35:32.875542+00
2        NaN        f         t  2015-01-06 14:36:01.970408+00
3        NaN        f         t     2015-01-27 15:36:51.889+00
4        NaN        f         t  2015-04-14 17:21:45.903994+00
5        NaN        f         t  2014-12-31 03:52:34.318484+00
6        NaN        f         t  2014-12-31 15:14:49.786013+00
7        NaN        f         t  2015-01-27 19:56:40.499636+00
8        NaN        f         t  2015-01-28 03:13:35.913577+00
9        NaN        f         t  2015-01-03 11:40:08.603636+00

                             dob email_verified points  \
0  2015-03-20 03:20:34.472988+00              f      0
1  2015-03-20 03:20:34.472988+00              f      0
2  2015-03-20 03:20:34.472988+00              f      0
3  2015-03-20 03:20:34.472988+00              f      0
4         2002-01-01 00:00:00+00              f      0
5  2015-03-20 03:20:34.472988+00              f      0
6  2015-03-20 03:20:34.472988+00              f      0
7  2015-03-20 03:20:34.472988+00              f      0
8  2015-03-20 03:20:34.472988+00              f      0
9  2015-03-20 03:20:34.472988+00              f      0

                    img_activity
0  2016-09-09 04:17:40.075083+00
1  2016-09-09 04:17:40.075083+00
2  2016-09-09 04:17:40.075083+00
3  2016-09-09 04:17:40.075083+00
4  2016-09-09 04:17:40.075083+00
5  2016-09-09 04:17:40.075083+00
6  2016-09-09 04:17:40.075083+00
7  2016-09-09 04:17:40.075083+00
8  2016-09-09 04:17:40.075083+00
9  2016-09-09 04:17:40.075083+00

[10 rows x 21 columns]

================= data/user_messages_message.csv =================
   id  room_id                                               body  sender_id  \
0   6        4  Is the government where you live running smoot...       5717
1   7        7  According to the article, Canada scientists fi...       6700
2   8        6  "According to the article, Canada scientists f...       6699
3   9        7  Imagine you held a place of power in your gove...       6700
4  11        7  Ask your PenPal a question about what the gove...       6700
5  12        8  According to the article, Canada scientists fi...       6694
6  13       12                                          Hello! :)       5292
7  14        6  Imagine you held a place of power in your gove...       6699
8  15        6  Ask your PenPal a question about what the gove...       6699
9  16       11  Imagine you held a place of power in your gove...       6696

                         sent_at deleted
0  2015-03-26 23:24:18.314082+00       f
1  2015-03-27 15:20:53.804654+00       f
2  2015-03-27 15:24:46.994541+00       f
3   2015-03-27 15:25:16.21155+00       f
4  2015-03-27 15:28:56.374408+00       f
5  2015-03-27 15:29:22.349769+00       f
6  2015-03-27 15:33:12.681731+00       f
7  2015-03-27 15:36:54.755049+00       f
8  2015-03-27 15:38:58.068763+00       f
9  2015-03-27 15:40:47.883934+00       f

/Users/Wenbo/anaconda/lib/python2.7/site-packages/IPython/core/interactiveshell.py:2821: DtypeWarning: Columns (13) have mixed types. Specify dtype option on import or set low_memory=False.
  if self.run_code(code, result):

#### First, how to define active and inactive stuent?
<p>I would like to use messages tables and response tables. The word count ,the frequency, the amount of total response, etc data will be used to identify whether a student is activie or not.</p>
#### Second, what I should use for classification?
<p>their profile data. Because Joe said they want to classify the student before the matching/class </p>

### data/course_match.csv
Select most of columns and see if there is a trends.

In [2]:
data_1=pd.read_csv("data/course_match.csv",usecols=['student_id','intro','new_match','age','course_start_date','target_start_date','skill','state','country','activity','points','pledge'])

#### ? Don't know pledge. Also the id in original csv file.

In [3]:
data_1.head()

,student_id,intro,new_match,age,course_start_date,target_start_date,skill,state,country,activity,points,pledge
0,123884,Australia beacause they have coalas,f,13,2017-01-09,2017-01-09,Intermediate,NaN,Denmark,2017-01-26 09:03:08.858457+00,300,t
1,125418,"Paris, France because it's the city of love.",f,13,2017-01-09,2017-01-09,Intermediate,FL,United States,2017-01-25 19:19:34.060776+00,300,t
2,17867,We are a free country.\nWe drink water.\nWe bo...,t,13,2015-05-25,2015-08-31,Beginner,AL,United States,2015-08-30 19:15:09.928069+00,150,f
3,18857,NaN,t,15,NaN,2015-08-31,Beginner,TX,United States,2015-08-30 19:14:26.770596+00,0,f
4,60318,Watch a hockey game,t,10,2016-02-01,2016-01-18,Beginner,OR,United States,2016-01-29 20:15:01.09436+00,100,f

In [4]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91259 entries, 0 to 91258
Data columns (total 12 columns):
student_id           91259 non-null int64
intro                74651 non-null object
new_match            91259 non-null object
age                  91259 non-null int64
course_start_date    76007 non-null object
target_start_date    91259 non-null object
skill                91259 non-null object
state                89681 non-null object
country              91248 non-null object
activity             91259 non-null object
points               91259 non-null int64
pledge               91259 non-null object
dtypes: int64(3), object(9)
memory usage: 8.4+ MB

In [5]:
data_1.describe()

          student_id           age        points
count   91259.000000  91259.000000  91259.000000
mean    71835.266878     12.593476    203.267075
std     36299.815653     26.125831    127.896151
min        88.000000    -71.000000      0.000000
25%     38751.500000     11.000000    100.000000
50%     75364.000000     12.000000    200.000000
75%    102613.500000     14.000000    300.000000
max    130738.000000   1996.000000    450.000000

#### Hypothesis
There is 91259 records, 74651 of them have introduction, 76007 have course_start_date, 89681 have state. SO:
<li>Not all records has "state" maybe because states are not available for some foreign contry.</li>
<li>? need to know why there are some records with no course_start_date.</li>
<li> some students may have no introduction.</li>
And from the statistic data:
<li> Age data has some problems: the min value should not be negative; the max value should not be 1996, which could be born year.</li>

In [ ]:
data_1.pop()

In [9]:
data_2 = pd.read_csv("data/course_questionresponse.csv")
data_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445977 entries, 0 to 445976
Data columns (total 7 columns):
id             445977 non-null int64
created        445977 non-null object
modified       445977 non-null object
match_id       445977 non-null int64
question_id    255484 non-null float64
text           445973 non-null object
unit_id        255484 non-null float64
dtypes: float64(2), int64(2), object(3)
memory usage: 23.8+ MB

In [10]:
data_2.describe()

                  id       match_id    question_id        unit_id
count  445977.000000  445977.000000  255484.000000  255484.000000
mean   293172.854874   50610.124193     415.205876      32.390005
std    157232.444675   28513.655944     258.006175      21.902441
min         2.000000      32.000000       2.000000       1.000000
25%    163848.000000   25333.000000     131.000000       4.000000
50%    300091.000000   49898.000000     393.000000      40.000000
75%    428269.000000   75802.000000     701.000000      43.000000
max    556424.000000  104177.000000     732.000000      96.000000

#### Question
question response only has match_id, what does id means? How can I know the response is made by whom? So I must use match table to find match id and student id?